zephyrproject-rtos/zephyr/soc/nxp/imxrt/imxrt118x/soc.c
#if DT_NODE_HAS_STATUS(DT_NODELABEL(tpm2), okay)
	/* Configure TPM2 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_TPM2_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Tpm2, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(tpm4), okay)
	/* Configure TPM4 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_TPM4_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Tpm4, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(tpm5), okay)
	/* Configure TPM5 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_TPM5_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Tpm5, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(tpm6), okay)
	/* Configure TPM6 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_TPM6_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Tpm6, &rootCfg);
#endif

#ifdef CONFIG_DT_HAS_NXP_MCUX_I3C_ENABLED

#if DT_NODE_HAS_STATUS(DT_NODELABEL(i3c1), okay)
	/* Configure I3C1 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_I3C1_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 10;
	CLOCK_SetRootClock(kCLOCK_Root_I3c1, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(i3c2), okay)
	/* Configure I3C2 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_I3C2_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 10;
	CLOCK_SetRootClock(kCLOCK_Root_I3c2, &rootCfg);
#endif

#endif /* CONFIG_DT_HAS_NXP_MCUX_I3C_ENABLED */

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(usb1)) && CONFIG_UDC_NXP_EHCI
	CLOCK_EnableUsbhs0PhyPllClock(kCLOCK_Usb480M,
		DT_PROP_BY_PHANDLE(DT_NODELABEL(usb1), clocks, clock_frequency));
	CLOCK_EnableUsbhs0Clock(kCLOCK_Usb480M,
		DT_PROP_BY_PHANDLE(DT_NODELABEL(usb1), clocks, clock_frequency));
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(usb2)) && CONFIG_UDC_NXP_EHCI
	CLOCK_EnableUsbhs1PhyPllClock(kCLOCK_Usb480M,
		DT_PROP_BY_PHANDLE(DT_NODELABEL(usb2), clocks, clock_frequency));
	CLOCK_EnableUsbhs1Clock(kCLOCK_Usb480M,
		DT_PROP_BY_PHANDLE(DT_NODELABEL(usb2), clocks, clock_frequency));
#endif

#ifdef CONFIG_IMX_USDHC

#if DT_NODE_HAS_STATUS(DT_NODELABEL(usdhc1), okay)
	/* Configure USDHC1 using SysPll2Pfd2 */
	rootCfg.mux = kCLOCK_USDHC1_ClockRoot_MuxSysPll2Pfd2;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_Usdhc1, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(usdhc2), okay)
	/* Configure USDHC2 using SysPll2Pfd2 */
	rootCfg.mux = kCLOCK_USDHC2_ClockRoot_MuxSysPll2Pfd2;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_Usdhc2, &rootCfg);
#endif

#endif /* CONFIG_IMX_USDHC */

#ifdef CONFIG_COUNTER_MCUX_LPIT
	/* LPIT1 use BUS_AON, LPIT2 use BUS_WAKEUP, which have been configured */
#if DT_NODE_HAS_STATUS(DT_NODELABEL(lpit3), okay)
	/* Configure LPIT3 using SysPll3Div2 */
	rootCfg.mux = kCLOCK_LPIT3_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Lpit3, &rootCfg);
#endif
#endif /* CONFIG_COUNTER_MCUX_LPIT */

	/* Keep core clock ungated during WFI */
	CCM->LPCG[1].LPM0 = 0x33333333;
	CCM->LPCG[1].LPM1 = 0x33333333;

	/* Let the core clock still running in WAIT mode */
	BLK_CTRL_S_AONMIX->M7_CFG |= BLK_CTRL_S_AONMIX_M7_CFG_CORECLK_FORCE_ON_MASK;

	/* Make AHB clock run (enabled) when CM7 is sleeping and TCM is accessible */
	BLK_CTRL_S_AONMIX->M7_CFG |= BLK_CTRL_S_AONMIX_M7_CFG_HCLK_FORCE_ON_MASK;

	/* Keep the system clock running so SYSTICK can wake up
	 * the system from wfi.
	 */
	GPC_CM_SetNextCpuMode(0, kGPC_RunMode);
	GPC_CM_SetNextCpuMode(1, kGPC_RunMode);
	GPC_CM_EnableCpuSleepHold(0, false);
	GPC_CM_EnableCpuSleepHold(1, false);
}

#ifdef CONFIG_I2S_MCUX_SAI
void imxrt_audio_codec_pll_init(uint32_t clock_name, uint32_t clk_src, uint32_t clk_pre_div,
				uint32_t clk_src_div)
{
	ARG_UNUSED(clk_pre_div);

	switch (clock_name) {
	case IMX_CCM_SAI1_CLK:
		CLOCK_SetRootClockMux(kCLOCK_Root_Sai1, clk_src);
		CLOCK_SetRootClockDiv(kCLOCK_Root_Sai1, clk_src_div);
		break;
	case IMX_CCM_SAI2_CLK:
		CLOCK_SetRootClockMux(kCLOCK_Root_Sai2, clk_src);
		CLOCK_SetRootClockDiv(kCLOCK_Root_Sai2, clk_src_div);
		break;
	case IMX_CCM_SAI3_CLK:
		CLOCK_SetRootClockMux(kCLOCK_Root_Sai3, clk_src);
		CLOCK_SetRootClockDiv(kCLOCK_Root_Sai3, clk_src_div);
		break;
	case IMX_CCM_SAI4_CLK:
		CLOCK_SetRootClockMux(kCLOCK_Root_Sai4, clk_src);
		CLOCK_SetRootClockDiv(kCLOCK_Root_Sai4, clk_src_div);
		break;
	default:
		return;
	}
}
#endif /* CONFIG_I2S_MCUX_SAI */


/**
 * @brief Initialize the system clock
 */
static ALWAYS_INLINE void trdc_enable_all_access(void)
{
	imxrt118x_trdc_enable_all_access();
}

/**
 *
 * @brief Perform basic hardware initialization
 *
 * Initialize the interrupt controller device drivers.
 * Also initialize the timer device driver, if required.
 * If dual core operation is enabled, the second core image will be loaded to RAM
 *
 * @return 0
 */

void soc_early_init_hook(void)
{
	/* Initialize system clock */
	clock_init();

#if (defined(CM33_SET_TRDC) && (CM33_SET_TRDC > 0U))
	/* Get trdc and enable all access modes for MBC and MRC of TRDCA and TRDCW */
	trdc_enable_all_access();
#endif /* (defined(CM33_SET_TRDC) && (CM33_SET_TRDC > 0U) */

#if defined(CONFIG_WDT_MCUX_RTWDOG)
	/* Unmask the watchdog reset channel */
	RTWDOG_IF_SET_SRC(0, 1)
	RTWDOG_IF_SET_SRC(1, 2)
	RTWDOG_IF_SET_SRC(2, 3)
	RTWDOG_IF_SET_SRC(3, 4)
	RTWDOG_IF_SET_SRC(4, 5)

	/* Clear the reset status otherwise TCM memory will reload in next reset */
	uint32_t mask = SRC_GetResetStatusFlags(SRC_GENERAL_REG);

	SRC_ClearGlobalSystemResetStatus(SRC_GENERAL_REG, mask);
#endif /* defined(CONFIG_WDT_MCUX_RTWDOG) */

#if (defined(CONFIG_SECOND_CORE_MCUX) && defined(CONFIG_CPU_CORTEX_M33))
#if !defined(CONFIG_CM7_BOOT_FROM_FLASH)
#include <zephyr_image_info.h>

/* Determine if CM33 needs to adjust the address to access CM7 memory */
#if ((CM7_BOOT_ADDRESS >= 0U) && (CM7_BOOT_ADDRESS <= 0x1FFFFU))
	/* Adjust to CM33 address to access CM7 ITCM */
	#define MEMMAP_ADJUST 0x303C0000U
#else
	#define MEMMAP_ADJUST 0U /* No adjustment needed */
#endif

/* Memcpy macro to copy segments from secondary core image stored in flash
 * to RAM section that secondary core boots from.
 * n is the segment number, as defined in zephyr_image_info.h
 */
#define MEMCPY_SEGMENT(n, _)						\
	memcpy((uint32_t *)(((SEGMENT_LMA_ADDRESS_ ## n)		\
			- ADJUSTED_LMA) + MEMMAP_ADJUST),		\
		(uint32_t *)(SEGMENT_LMA_ADDRESS_ ## n),		\
		(SEGMENT_SIZE_ ## n))

	/**
	 * Copy CM7 core from flash to memory. Note that depending on where the
	 * user decided to store CM7 code, this is likely going to read from the
	 * flexspi while using XIP. Provided we DO NOT WRITE TO THE FLEXSPI,
	 * this operation is safe.
	 *
	 * Note that this copy MUST occur before enabling the M33 caching to
	 * ensure the data is written directly to RAM (since the M4 core will use it)
	 */
	LISTIFY(SEGMENT_NUM, MEMCPY_SEGMENT, (;));
#endif /* !defined(CONFIG_CM7_BOOT_FROM_FLASH) */
#endif /* (defined(CONFIG_SECOND_CORE_MCUX) && defined(CONFIG_CPU_CORTEX_M33)) */

	/* Enable data cache */
	sys_cache_data_enable();

	__ISB();
	__DSB();
}

#ifdef CONFIG_SOC_RESET_HOOK
void soc_reset_hook(void)
{
	SystemInit();

#if defined(CONFIG_SECOND_CORE_MCUX) && defined(CONFIG_CPU_CORTEX_M33)
	Prepare_CM7(CM7_BOOT_ADDRESS);
#endif
}
#endif

#if defined(CONFIG_SECOND_CORE_MCUX) && defined(CONFIG_CPU_CORTEX_M33)

static int second_core_boot(void)
{
	/*
	 * RT1180 Specific CM7 Kick Off operation
	 */
	/* Trigger S401 */
	while ((MU_RT_S3MUA->TSR & MU_TSR_TE0_MASK) == 0) {
		; } /* Wait TR empty */
	MU_RT_S3MUA->TR[0] = 0x17d20106;
	while ((MU_RT_S3MUA->RSR & MU_RSR_RF0_MASK) == 0) {
		; } /* Wait RR Full */
	while ((MU_RT_S3MUA->RSR & MU_RSR_RF1_MASK) == 0) {
		; } /* Wait RR Full */

	/* Response from ELE must be always read */
	__attribute__((unused)) volatile uint32_t result1, result2;
	result1 = MU_RT_S3MUA->RR[0];
	result2 = MU_RT_S3MUA->RR[1];

	/* Disable M7 clock before clearing CPU_WAIT bit */
	CLOCK_DisableClock(kCLOCK_M7);

	/* Deassert Wait */
	BLK_CTRL_S_AONMIX->M7_CFG =
		(BLK_CTRL_S_AONMIX->M7_CFG & (~BLK_CTRL_S_AONMIX_M7_CFG_WAIT_MASK)) |
		BLK_CTRL_S_AONMIX_M7_CFG_WAIT(0);

	/* Re-enable M7 clock again */
	CLOCK_EnableClock(kCLOCK_M7);

	return 0;
}

SYS_INIT(second_core_boot, PRE_KERNEL_2, CONFIG_KERNEL_INIT_PRIORITY_DEFAULT);
#endif
